modm-ext/data.modm.io/docs/svd/header_stm32l562xx.svd
    <peripheral derivedFrom="RTC">
      <name>RTC_S</name>
      <description>Real-Time Clock</description>
      <baseAddress>0x50002800</baseAddress>
      <interrupt>
        <name>RTC_S</name>
        <description>RTC secure interrupts through the EXTI line 18</description>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>WWDG_S</name>
      <description>Window WATCHDOG</description>
      <baseAddress>0x50002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="IWDG">
      <name>IWDG_S</name>
      <description>Independent WATCHDOG</description>
      <baseAddress>0x50003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TAMP">
      <name>TAMP_S</name>
      <description>Tamper and backup registers</description>
      <baseAddress>0x50003400</baseAddress>
      <interrupt>
        <name>TAMP_S</name>
        <description>Tamper and TimeStamp interrupts through the EXTI line 20</description>
        <value>5</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI2_S</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x50003c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART2_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART3_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART4_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C1_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CRS">
      <name>CRS_S</name>
      <description>Clock Recovery System</description>
      <baseAddress>0x50006000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PWR">
      <name>PWR_S</name>
      <description>Power Control</description>
      <baseAddress>0x50007000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC1">
      <name>DAC1_S</name>
      <description>Digital to Analog Converter</description>
      <baseAddress>0x50007400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC1">
      <name>DAC_S</name>
      <description>Digital to Analog Converter</description>
      <alternatePeripheral>DAC1_S</alternatePeripheral>
      <baseAddress>0x50007400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP12_COMMON">
      <name>OPAMP12_COMMON_S</name>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP1_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <alternatePeripheral>OPAMP12_COMMON_S</alternatePeripheral>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP">
      <name>OPAMP_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <alternatePeripheral>OPAMP12_COMMON_S</alternatePeripheral>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP2">
      <name>OPAMP2_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <baseAddress>0x50007810</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM1">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x50007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50008000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50008400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM1">
      <name>LPTIM2_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x50009400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM1">
      <name>LPTIM3_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x50009800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN1_S</name>
      <description>FD Controller Area Network</description>
      <baseAddress>0x5000a400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN_CONFIG">
      <name>FDCAN_CONFIG_S</name>
      <description>FD Controller Area Network Configuration</description>
      <baseAddress>0x5000a500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB">
      <name>USB_S</name>
      <description>Universal Serial Bus Full Speed Device</description>
      <baseAddress>0x5000d400</baseAddress>
    </peripheral>
